Mos/AdvancedJava/JTAJCAWORK/MAILBridge/file.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns3:requestOrder xmlns:ns2="e-commerceANDm-commerce:ShoppingStandards" xmlns:ns3="org.mk.training@gmail.com/MessageDefinitions"><CustomerNumber>123456</CustomerNumber><PurchaseOrderNumber>654321</PurchaseOrderNumber><ns2:CreditCard><Type>VISA</Type><Number>55555555555555</Number><ExpiryDate>2012-09-13+05:30</ExpiryDate><Name>007007</Name><Amount>0.0</Amount></ns2:CreditCard><ns2:Cart><Item><Name>Porsche</Name><ItemNumber>00000</ItemNumber><Quantity>2</Quantity><PricePerUnit>55555</PricePerUnit></Item></ns2:Cart></ns3:requestOrder></S:Body></S:Envelope>